In [1]:
# Imports
from math import sqrt
from scipy import stats
from pydataset import data
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

## 1) Attendance Data

Load the attendance.csv file and calculate an attendnace percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [80]:
# import attendance data
attendance_df = pd.read_csv('untidy-data/attendance.csv')

In [81]:
attendance_df

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [82]:
# rename 'Unnamed: 0' column to 'name'
attendance_df = attendance_df.rename(columns = {'Unnamed: 0': 'name'})

In [83]:
# melt the days using attendace status as value
df_melt = attendance_df.melt(id_vars=['name'], var_name='day', value_name='status')
df_melt.head()

    name         day status
0  Sally  2018-01-01      P
1   Jane  2018-01-01      A
2  Billy  2018-01-01      A
3   John  2018-01-01      P
4  Sally  2018-01-02      T

In [84]:
# replace status alpha values with numerics
df_melt['status'] = df_melt['status'].replace({'T':0.9, 'P':1, 'A':0.0, 'H':0.5})

In [85]:
df_melt.head()

    name         day  status
0  Sally  2018-01-01     1.0
1   Jane  2018-01-01     0.0
2  Billy  2018-01-01     0.0
3   John  2018-01-01     1.0
4  Sally  2018-01-02     0.9

In [86]:
# groupby to aggregate values and determine attendance days
df_melt.groupby(by=['name']).mean()

       status
name
Billy  0.5250
Jane   0.6875
John   0.9125
Sally  0.7625

## 2) Coffee Levels

In [87]:
# Read the coffee_levels.csv file.
coffee_df = pd.read_csv('untidy-data/coffee_levels.csv')

In [88]:
coffee_df.head(25)

    hour coffee_carafe  coffee_amount
0      8             x       0.816164
1      9             x       0.451018
2     10             x       0.843279
3     11             x       0.335533
4     12             x       0.898291
5     13             x       0.310711
6     14             x       0.507288
7     15             x       0.215043
8     16             x       0.183891
9     17             x       0.391560
10     8             y       0.189297
11     9             y       0.521502
12    10             y       0.023163
13    11             y       0.235529
14    12             y       0.017009
15    13             y       0.997464
16    14             y       0.058361
17    15             y       0.144644
18    16             y       0.544676
19    17             y       0.594126
20     8             z       0.999264
21     9             z       0.915990
22    10             z       0.144928
23    11             z       0.311495
24    12             z       0.771947

In [89]:
# Transform the data so that each carafe is in it's own column.
coffee_df_piv = coffee_df.pivot_table(index=['hour'], columns='coffee_carafe', values='coffee_amount')

In [90]:
coffee_df_piv

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947
13             0.310711  0.997464  0.398520
14             0.507288  0.058361  0.864464
15             0.215043  0.144644  0.436364
16             0.183891  0.544676  0.280621
17             0.391560  0.594126  0.436677

In [91]:
# Is this the best shape for the data? Sure appear so

## 3) Cake Recipes

In [92]:
# Read the cake_recipes.csv data. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
cake_df = pd.read_csv('untidy-data/cake_recipes.csv')

In [93]:
cake_df

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084
5           c:top  71.306308  82.795477  92.098049  53.960273
6        d:bottom  52.799753  58.670419  51.747686  56.183110
7           d:top  96.873178  76.101363  59.571620  50.971626

In [96]:
# Clean up the double entry column and split values into two separate columns
cake_df[['recipe', 'position']] = cake_df['recipe:position'].str.split(':', expand=True)

In [99]:
# Delete original coulumn to cleanup double entries
del cake_df['recipe:position']

In [100]:
# check
cake_df

         225        250        275        300 recipe position
0  61.738655  53.912627  74.414730  98.786784      a   bottom
1  51.709751  52.009735  68.576858  50.228470      a      top
2  57.095320  61.904369  61.196980  99.248541      b   bottom
3  82.455004  95.224151  98.594881  58.169349      b      top
4  96.470207  52.001358  92.893227  65.473084      c   bottom
5  71.306308  82.795477  92.098049  53.960273      c      top
6  52.799753  58.670419  51.747686  56.183110      d   bottom
7  96.873178  76.101363  59.571620  50.971626      d      top

In [124]:
# Which recipe, on average, is the best? recipe b

# Melt the temps into dataframe
melted_cake = cake_df.melt(id_vars=['recipe', 'position'], var_name='temp', value_name='score')
# Take the mean of scores across recipe
melted_cake.groupby(by=['recipe']).mean()

# Judging best by avg taste scores, Recipe B would be best

            score
recipe
a       63.922201
b       76.736074
c       75.874748
d       62.864844

In [127]:
# Which oven temperature, on average, produces the best results? 275

# Take the mean of scores across temperature
melted_cake.groupby(by=['temp']).mean()

# 275 degrees, on avg, produces best results

          score
temp
225   71.306022
250   66.577437
275   74.886754
300   66.627655
avg   69.849467

In [131]:
# Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees
melted_cake.max()

recipe            d
position        top
temp            avg
score       99.2485
dtype: object